using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace GRPlatForm
{
    /// <summary>
    /// 区域映射类
    /// </summary>
    public static class AreaMapping
    {
      public  static Dictionary<string, string> AreaDic = new Dictionary<string, string>();


        public static void InitDic()
        {
            AreaDic.Add("2", "331100000000");//丽水市
            AreaDic.Add("3", "331124000000");//松阳县

            AreaDic.Add("9", "331124100000");//西屏镇
            AreaDic.Add("16", "331124101000");//古市镇
            AreaDic.Add("26", "331124102000");//玉岩镇
            AreaDic.Add("21", "331124103000");//象溪镇
            AreaDic.Add("24", "331124104000");//大东坝镇
            AreaDic.Add("11", "331124200000");//望松乡
            AreaDic.Add("12", "331124201000");//叶村乡
            AreaDic.Add("20", "331124202000");//斋坛乡
            AreaDic.Add("14", "331124203000");//三都乡


            AreaDic.Add("13", "331124204000");//竹源乡
            AreaDic.Add("15", "331124205000");//四都乡
            AreaDic.Add("18", "331124206000");//赤寿乡
            AreaDic.Add("17", "331124207000");//新兴乡
            AreaDic.Add("19", "331124208000");//樟溪乡
          //  AreaDic.Add("00030102", "331124209000");//谢村乡
          //  AreaDic.Add("00030102", "331124210000");//新处乡
            AreaDic.Add("27", "331124211000");//枫坪乡
            AreaDic.Add("23", "331124212000");//板桥畲族乡

            AreaDic.Add("22", "331124213000");//裕溪乡
            AreaDic.Add("25", "331124214000");//安民乡









            AreaDic.Add("29", "331124100002");//城南社区
            AreaDic.Add("30", "331124100003");//城西社区
            AreaDic.Add("31", "331124100004");//城北区
            AreaDic.Add("32", "331124100005");//城中区
            AreaDic.Add("33", "331124100006");//古城区
            AreaDic.Add("34", "331124100231");//邵山脚村
            AreaDic.Add("36", "331124100232");//竹客口村
            AreaDic.Add("37", "331124100226");//源内村
            AreaDic.Add("38", "331124100230");//丁山头村
            AreaDic.Add("39", "331124100229");//西坌村
            AreaDic.Add("40", "331124100228");//项桥下村

            AreaDic.Add("41", "331124100225");//大路口村
            AreaDic.Add("42", "331124100215");//北山村
            AreaDic.Add("43", "331124100224");//铺门村
            AreaDic.Add("44", "331124100212");//上连头村
            AreaDic.Add("45", "331124100223");//阳东坑村
            AreaDic.Add("46", "331124100222");//官溪村
            AreaDic.Add("47", "331124100211");//塔寺下村
            AreaDic.Add("48", "331124100220");//桐溪村
            AreaDic.Add("49", "331124100218");//乌形山村
            AreaDic.Add("50", "331124100006");//瓦厂村?   暂未对应上   沿用古城社区的区划代码


            AreaDic.Add("51", "331124100213");//项弄村
            AreaDic.Add("52", "331124001233");//黄公渡村
            AreaDic.Add("53", "331124100214");//白沙村
            AreaDic.Add("54", "331124100221");//活源村
            AreaDic.Add("55", "331124100216");//青蒙村
            AreaDic.Add("56", "331124100219");//周坌村
            AreaDic.Add("57", "331124100217");//水车村
            AreaDic.Add("59", "331124100233");//大竹溪村
            AreaDic.Add("60", "331124100234");//新溪村
            AreaDic.Add("61", "331124100235");//市口村

            AreaDic.Add("62", "331124100236");//潘村村
            AreaDic.Add("63", "331124100237");//岩西村
            AreaDic.Add("64", "331124100238");//桥头村
            AreaDic.Add("65", "331124100239");//清路村
            AreaDic.Add("66", "331124100240");//郑弄口村
            AreaDic.Add("67", "331124100241");//南山村
            AreaDic.Add("68", "331124100242");//横山村
            AreaDic.Add("69", "331124100243");//踏埠步头村
            AreaDic.Add("70", "331124100244");//程徐村
            AreaDic.Add("71", "331124100245");//水南村

            AreaDic.Add("72", "331124100246");//青龙村
            AreaDic.Add("73", "331124100247");//岩下村
            AreaDic.Add("74", "331124100248");//塘寮村
            AreaDic.Add("75", "331124100249");//东岗寮村
            AreaDic.Add("76", "331124100250");//安乐山村
            AreaDic.Add("77", "331124100251");//瓦窑头村  
            AreaDic.Add("78", "331124200208");//乌井村
            AreaDic.Add("79", "331124200215");//砌坛村
            AreaDic.Add("80", "331124200200");//六都源口村
            AreaDic.Add("81", "331124200202");//吴弄村

            AreaDic.Add("82", "331124200201");//六都村
            AreaDic.Add("83", "331124200206");//仪桥村
            AreaDic.Add("84", "331124200204");//半岭村
            AreaDic.Add("85", "331124200211");//郑家村
            AreaDic.Add("86", "331124200218");//翁村村
            AreaDic.Add("87", "331124200203");//山仁下村
            AreaDic.Add("88", "331124200214");//山头背村
            AreaDic.Add("89", "331124200213");//麻阳塔村
            AreaDic.Add("90", "331124200212");//岗后村
            AreaDic.Add("91", "331124200209");//乌石下村

            AreaDic.Add("92", "331124200210");//西河村
            AreaDic.Add("93", "331124200205");//王村村
            AreaDic.Add("94", "331124200216");//草塔村
            AreaDic.Add("95", "331124200217");//五都阳村
            AreaDic.Add("96", "331124200207");//石门村
            AreaDic.Add("97", "331124200219");//榔阳村
            AreaDic.Add("98", "331124201206");//叶村村
            AreaDic.Add("99", "331124201208");//官田村
            AreaDic.Add("100", "331124201205");//寺山村
            AreaDic.Add("101", "331124201213");//横坑村


            AreaDic.Add("102", "331124201203");//河头村
            AreaDic.Add("103", "331124201211");//东坞村
            AreaDic.Add("104", "331124201210");//叶村源口村
            AreaDic.Add("105", "331124201204");//松山村
            AreaDic.Add("106", "331124201209");//麻寮村
            AreaDic.Add("107", "331124201201");//叶家村
            AreaDic.Add("108", "331124201212");//膳垄村
            AreaDic.Add("109", "331124201202");//包安山村
            AreaDic.Add("110", "331124201214");//斗米坳村
            AreaDic.Add("111", "331124201215");//南岱村

            AreaDic.Add("112", "331124201216");//岱头村
            AreaDic.Add("113", "331124204202");//小竹溪村
            AreaDic.Add("114", "331124204204");//呈田村
            AreaDic.Add("115", "331124204205");//可重旺村
            AreaDic.Add("116", "331124204208");//黄上村
            AreaDic.Add("117", "331124204207");//燕庄村
            AreaDic.Add("118", "331124204209");//黄下村
            AreaDic.Add("119", "331124204203");//横岗村
            AreaDic.Add("120", "331124204206");//潘坑村
            AreaDic.Add("121", "331124204210");//周岭根村

            AreaDic.Add("122", "331124204200");//后畲村
            AreaDic.Add("123", "331124204201");//大岭头村
            AreaDic.Add("124", "331124203205");//松庄村
            AreaDic.Add("125", "331124203200");//杨家堂村
            AreaDic.Add("126", "331124203206");//毛源村
            AreaDic.Add("127", "331124203203");//后湾村
            AreaDic.Add("128", "331124203202");//酉田村
            AreaDic.Add("129", "331124203207");//上庄村
            AreaDic.Add("130", "331124203204");//下田村
            AreaDic.Add("131", "331124203210");//尹源村

            AreaDic.Add("132", "331124203217");//上田村
            AreaDic.Add("133", "331124203213");//上源村
            AreaDic.Add("134", "331124203201");//岭上村
            AreaDic.Add("135", "331124203211");//水竹村
            AreaDic.Add("136", "331124203216");//紫草村
            AreaDic.Add("137", "331124203209");//淡竹村
            AreaDic.Add("138", "331124203212");//呈回村
            AreaDic.Add("139", "331124203214");//黄岭根村
            AreaDic.Add("140", "331124203215");//周山头村
            AreaDic.Add("141", "331124203208");//里庄村

            AreaDic.Add("142", "331124205200");//下包村
            AreaDic.Add("143", "331124205209");//汤城村
            AreaDic.Add("144", "331124205208");//午岭村
            AreaDic.Add("145", "331124205204");//平田村
            AreaDic.Add("146", "331124205201");//章田村
            AreaDic.Add("147", "331124205203");//塘后村
            AreaDic.Add("148", "331124205205");//陈家铺村
            AreaDic.Add("149", "331124205202");//柘坑村
            AreaDic.Add("150", "331124205206");//庄河村
            AreaDic.Add("151", "331124205207");//西坑村


            AreaDic.Add("152", "331124205210");//榔树村
            AreaDic.Add("153", "331124101007");//古南社区 
            AreaDic.Add("154", "331124101008");//古北社区  
            AreaDic.Add("155", "331124101216");//庄门村
            AreaDic.Add("156", "331124101200");//上方村
            AreaDic.Add("157", "331124101211");//东角垄村
            AreaDic.Add("158", "331124101215");//源口村
            AreaDic.Add("159", "331124101217");//白角外村
            AreaDic.Add("160", "331124101214");//湖溪村
            AreaDic.Add("161", "331124101212");//塘头村

            AreaDic.Add("162", "331124101213");//刘边村
            AreaDic.Add("163", "331124101005");//筏铺村
            AreaDic.Add("164", "331124101218");//上五木村
            AreaDic.Add("165", "331124101221");//下五木村
            AreaDic.Add("166", "331124101227");//谢树寮村
            AreaDic.Add("167", "331124101220");//黄圩村
            AreaDic.Add("168", "331124207207");//横溪村
            AreaDic.Add("169", "331124101225");//山下阳村
            AreaDic.Add("170", "331124101223");//岗下村
            AreaDic.Add("171", "331124207216");//大石村

            AreaDic.Add("172", "331124101229");//下社村
            AreaDic.Add("173", "331124101219");//下黄圩村
            AreaDic.Add("174", "331124207215");//后周包村
            AreaDic.Add("175", "331124101224");//上河村
            AreaDic.Add("176", "331124207214");//杨村头村
            AreaDic.Add("177", "331124101222");//寺口村
            AreaDic.Add("178", "331124207209");//泉庄村
            AreaDic.Add("179", "331124207213");//进贤村
            AreaDic.Add("180", "331124101228");//黄埠头村
            AreaDic.Add("181", "331124207212");//外孟村

            AreaDic.Add("182", "331124101226");//十五里村
            AreaDic.Add("183", "331124207208");//渡市村
            AreaDic.Add("184", "331124101006");//新铺社区  
            AreaDic.Add("185", "331124207219");//金坞村
            AreaDic.Add("186", "331124207206");//高丰村
            AreaDic.Add("187", "331124207211");//上源口村
            AreaDic.Add("188", "331124207210");//徐郑村
            AreaDic.Add("189", "331124206203");//赤三村
            AreaDic.Add("190", "331124207205");//后刘村
            AreaDic.Add("191", "331124207204");//端口村

            AreaDic.Add("192", "331124206202");//赤四村
            AreaDic.Add("193", "331124207203");//上安村
            AreaDic.Add("194", "331124206212");//大川村
            AreaDic.Add("195", "331124207217");//内孟村
            AreaDic.Add("196", "331124207202");//潘连村
            AreaDic.Add("197", "331124207201");//贤溪村
            AreaDic.Add("198", "331124206218");//田岗村
            AreaDic.Add("199", "331124207218");//大畈村
            AreaDic.Add("200", "331124206211");//楼塘村
            AreaDic.Add("201", "331124207200");//下源口村

            AreaDic.Add("202", "331124210205");//新处村
            AreaDic.Add("203", "331124206210");//龙下村
            AreaDic.Add("204", "331124210204");//外石塘村
            AreaDic.Add("205", "331124210211");//坳后村
            AreaDic.Add("206", "331124206217");//黄山头村
            AreaDic.Add("207", "331124210209");//小岭头村
            AreaDic.Add("208", "331124210208");//东北头村



            AreaDic.Add("209", "331124206200");//界首村
            AreaDic.Add("210", "331124210200");//小南坑村
            AreaDic.Add("211", "331124210203");//张山头村
            AreaDic.Add("212", "331124206209");//墙里村
            AreaDic.Add("213", "331124210206");//竹坌村
            AreaDic.Add("214", "331124210210");//朱山村
            AreaDic.Add("215", "331124206208");//半古月村
            AreaDic.Add("216", "331124206201");//狮子口村
            AreaDic.Add("217", "331124210202");//山甫村
            AreaDic.Add("218", "331124206214");//梧桐口村

            AreaDic.Add("219", "331124210207");//庄后村
            AreaDic.Add("220", "331124210201");//赤岩村
            AreaDic.Add("221", "331124206205");//择子山村
            AreaDic.Add("222", "331124105243");//官岭村？关 
            AreaDic.Add("223", "331124209200");//塔岭村
            AreaDic.Add("224", "331124206213");//叶川头村
            AreaDic.Add("225", "331124209203");//孟坑村
            AreaDic.Add("226", "331124209204");//平卿村
            AreaDic.Add("227", "331124206216");//黄坑口村
            AreaDic.Add("228", "331124209202");//大岭根村

            AreaDic.Add("229", "331124206206");//朝阳村
            AreaDic.Add("230", "331124206215");//卯山后村
            AreaDic.Add("231", "331124105221");//李山头村
            AreaDic.Add("232", "331124206207");//红连村
            AreaDic.Add("233", "331124209205");//大岭里村
            AreaDic.Add("234", "331124206204");//章家村
            AreaDic.Add("235", "331124209206");//南坑村
            AreaDic.Add("236", "331124209207");//谢村村
            AreaDic.Add("237", "331124209208");//谢西坑村
            AreaDic.Add("238", "331124209209");//上仓村

            AreaDic.Add("239", "331124209210");//大铺村
            AreaDic.Add("240", "331124208211");//肖周村
            AreaDic.Add("241", "331124208213");//溪下村
            AreaDic.Add("242", "331124202210");//斋坛村
            AreaDic.Add("243", "331124208216");//下马坑村
            AreaDic.Add("244", "331124202208");//金梁村
            AreaDic.Add("245", "331124208214");//兴村村
            AreaDic.Add("246", "331124208215");//包村村
            AreaDic.Add("247", "331124208217");//高岸村
            AreaDic.Add("248", "331124208212");//上徐山村

            AreaDic.Add("249", "331124208209");//大徐村
            AreaDic.Add("250", "331124208207");//福村村
            AreaDic.Add("251", "331124208201");//力溪村
            AreaDic.Add("252", "331124202200");//石门圩村
            AreaDic.Add("253", "331124208210");//陆家村
            AreaDic.Add("254", "331124208208");//兰家村
            AreaDic.Add("255", "331124202203");//花田坌村
            AreaDic.Add("256", "331124208202");//馒头山村
            AreaDic.Add("257", "331124202204");//坎头村
            AreaDic.Add("258", "331124208218");//西源村

            AreaDic.Add("259", "331124202209");//东圩蓬村
            AreaDic.Add("260", "331124208206");//樟村村
            AreaDic.Add("261", "331124208221");//黄田村
            AreaDic.Add("262", "331124202207");//小石村
            AreaDic.Add("263", "331124202201");//东关村
            AreaDic.Add("264", "331124208200");//富兴村
            AreaDic.Add("265", "331124202205");//大路村
            AreaDic.Add("266", "331124208204");//岗头儿村
            AreaDic.Add("267", "331124202202");//桐楼村
            AreaDic.Add("268", "331124208205");//谷山垄村

            AreaDic.Add("269", "331124208203");//东市村
            AreaDic.Add("270", "331124202211");//桐村村
            AreaDic.Add("271", "331124208219");//杨岭脚村
            AreaDic.Add("272", "331124208220");//球坑村
            AreaDic.Add("273", "331124202206");//吊坛村
            AreaDic.Add("274", "331124202212");//上坌村
            AreaDic.Add("275", "331124202213");//下坌村
            AreaDic.Add("276", "331124103218");//象一村
            AreaDic.Add("277", "331124103216");//象二村
            AreaDic.Add("278", "331124103229");//鲁峰村

            AreaDic.Add("279", "331124103204");//程路后村
            AreaDic.Add("280", "331124213207");//裕溪村
            AreaDic.Add("281", "331124103230");//下寮儿村
            AreaDic.Add("282", "331124103203");//金山头村
            AreaDic.Add("283", "331124213205");//黄岭头村
            AreaDic.Add("284", "331124103227");//上梅村
            AreaDic.Add("285", "331124213206");//潘山村
            AreaDic.Add("286", "331124103228");//陈家里村
            AreaDic.Add("287", "331124103231");//村头村
            AreaDic.Add("288", "331124213204");//叶西后村

            AreaDic.Add("289", "331124103226");//小佛儿村
            AreaDic.Add("290", "331124103233");//鲁西村
            AreaDic.Add("291", "331124213203");//徐山村
            AreaDic.Add("292", "331124213202");//小槎村
            AreaDic.Add("293", "331124103225");//靖居村
            AreaDic.Add("294", "331124213209");//章山村
            AreaDic.Add("295", "331124103232");//塘里源村
            AreaDic.Add("296", "331124213201");//内陈村
            AreaDic.Add("297", "331124103205");//龙湾村
            AreaDic.Add("298", "331124103206");//石鼓村

            AreaDic.Add("299", "331124213208");//凤弄源村
            AreaDic.Add("300", "331124103224");//石牌门村
            AreaDic.Add("301", "331124213210");//合溪村
            AreaDic.Add("302", "331124103234");//坑里村
            AreaDic.Add("303", "331124213200");//木岱坑村
            AreaDic.Add("304", "331124103207");//东田村
            AreaDic.Add("305", "331124213211");//源底村
            AreaDic.Add("306", "331124103223");//黄店村
            AreaDic.Add("307", "331124103211");//石马源村
            AreaDic.Add("308", "331124212200");//板桥村


            AreaDic.Add("309", "331124212203");//桐榔村
            AreaDic.Add("310", "331124103210");//潘弄村
            AreaDic.Add("311", "331124212202");//后塘村
            AreaDic.Add("312", "331124103208");//吴村村
            AreaDic.Add("313", "331124212201");//金村村
            AreaDic.Add("314", "331124103221");//金钟村
            AreaDic.Add("315", "331124103222");//大塔村
            AreaDic.Add("316", "331124212208");//大毛科村
            AreaDic.Add("317", "331124103202");//吕潭村
            AreaDic.Add("318", "331124212204");//潘八村

            AreaDic.Add("319", "331124103209");//雅溪口村
            AreaDic.Add("320", "331124212207");//东坑村
            AreaDic.Add("321", "331124103212");//石马铺村
            AreaDic.Add("322", "331124212205");//张山村
            AreaDic.Add("323", "331124103213");//南州村
            AreaDic.Add("324", "331124212206");//高山村
            AreaDic.Add("325", "331124103217");//高岭村
            AreaDic.Add("326", "331124103215");//下坑源村
            AreaDic.Add("327", "331124103201");//南坑口村
            AreaDic.Add("328", "331124103220");//靖居口村

            AreaDic.Add("329", "331124103214");//塔背村
            AreaDic.Add("330", "331124103219");//毛弄村
            AreaDic.Add("331", "331124103200");//南坑源村
            AreaDic.Add("332", "331124104213");//大东坝村
            AreaDic.Add("333", "331124104209");//西山村
            AreaDic.Add("334", "331124214203");//大潘坑村
            AreaDic.Add("335", "331124104212");//白峰村
            AreaDic.Add("336", "331124214202");//李坑村
            AreaDic.Add("337", "331124104210");//百步村
            AreaDic.Add("338", "331124214207");//苏马坪村

            AreaDic.Add("339", "331124104214");//赤圩村
            AreaDic.Add("340", "331124104219");//上寮山村
            AreaDic.Add("341", "331124214205");//曹竹村
            AreaDic.Add("342", "331124104211");//牛角圩村
            AreaDic.Add("343", "331124214200");//安岱后村
            AreaDic.Add("344", "331124104220");//横樟村
            AreaDic.Add("345", "331124214204");//台坑村
            AreaDic.Add("346", "331124104227");//大樟源口村
            AreaDic.Add("347", "331124214206");//乌弄村
            AreaDic.Add("348", "331124104208");//七村村

            AreaDic.Add("349", "331124214201");//大横坑村
            AreaDic.Add("350", "331124104217");//外大阴村
            AreaDic.Add("351", "331124104229");//黄南村
            AreaDic.Add("352", "331124211212");//枫坪村
            AreaDic.Add("353", "331124211209");//金竹村
            AreaDic.Add("354", "331124104215");//树稍村
            AreaDic.Add("355", "331124104222");//山徐村
            AreaDic.Add("356", "331124211210");//钱余村
            AreaDic.Add("357", "331124104228");//五部村
            AreaDic.Add("358", "331124104216");//二滩坝村


            AreaDic.Add("359", "331124104207");//六村村
            AreaDic.Add("360", "331124104221");//蛤湖村
            AreaDic.Add("361", "331124104206");//山边村
            AreaDic.Add("362", "331124211208");//根下村
            AreaDic.Add("363", "331124104226");//小后畲村
            AreaDic.Add("364", "331124104223");//洋坑埠头村
            AreaDic.Add("365", "331124211205");//洋庄源村
            AreaDic.Add("366", "331124104205");//下宅街村
            AreaDic.Add("367", "331124104204");//山头村
            AreaDic.Add("368", "331124104225");//燕田村

            AreaDic.Add("369", "331124211214");//黄埠坞村
            AreaDic.Add("370", "331124104201");//后宅村
            AreaDic.Add("371", "331124104203");//蔡宅村
            AreaDic.Add("372", "331124104200");//灯塔村
            AreaDic.Add("373", "331124104202");//梨树岗村
            AreaDic.Add("374", "331124104218");//内大阴村
            AreaDic.Add("375", "331124104224");//明源村
            AreaDic.Add("376", "331124102200");//玉岩村
            AreaDic.Add("377", "331124102224");//道惠口村
            AreaDic.Add("378", "331124102227");//程岭根村

            AreaDic.Add("379", "331124102226");//程路村
            AreaDic.Add("380", "331124102225");//道惠村
            AreaDic.Add("381", "331124102228");//烧火坑村
            AreaDic.Add("382", "331124102231");//周坑村
            AreaDic.Add("383", "331124102230");//白沙岗村？ 现新岗村村委会
            AreaDic.Add("384", "331124102229");//程源头村
            AreaDic.Add("385", "331124102215");//西沿头村
            AreaDic.Add("386", "331124102213");//洋坑村
            AreaDic.Add("387", "331124102216");//大树后村
            AreaDic.Add("388", "331124102212");//周安村

            AreaDic.Add("389", "331124102217");//潘山头村
            AreaDic.Add("390", "331124102222");//大岭脚村
            AreaDic.Add("391", "331124102221");//白麻山村
            AreaDic.Add("392", "331124102214");//梨步坑村
            AreaDic.Add("393", "331124102211");//支木村
            AreaDic.Add("394", "331124102220");//交塘村
            AreaDic.Add("395", "331124102223");//何山头村
            AreaDic.Add("396", "331124102208");//乌岩村
            AreaDic.Add("397", "331124102219");//根坑村
            AreaDic.Add("398", "331124102218");//何庄村

            AreaDic.Add("399", "331124102201");//溪口村
            AreaDic.Add("400", "331124102209");//吴山头村
            AreaDic.Add("401", "331124102206");//余叶村
            AreaDic.Add("402", "331124102203");//沙丘村
            AreaDic.Add("403", "331124102207");//坳头村
            AreaDic.Add("404", "331124102210");//大丘下村
            AreaDic.Add("405", "331124102202");//排居口村
            AreaDic.Add("406", "331124102204");//步新村
            AreaDic.Add("407", "331124102205");//召楼村
            AreaDic.Add("408", "331124211207");//斗潭村

            AreaDic.Add("409", "331124211211");//沿坑岭头村
            AreaDic.Add("410", "331124211215");//珠岱村
            AreaDic.Add("411", "331124211204");//高寮村
            AreaDic.Add("412", "331124211206");//山乍口村
            AreaDic.Add("413", "331124211203");//高亭村
            AreaDic.Add("414", "331124211213");//丁坑村
            AreaDic.Add("415", "331124211216");//梨树下村
            AreaDic.Add("416", "331124211201");//龙虎坳村
            AreaDic.Add("417", "331124211202");//南胜村
            AreaDic.Add("418", "331124211200");//小吉村


            AreaDic.Add("426", "331124201200");//寺岭下

            AreaDic.Add("448", "331124201299");//道家镇 测试数据 20180116

            AreaDic.Add("427", "331124201300");//测试1镇   
            AreaDic.Add("428", "331124201301");//测试1村   
        
        }
    }
}
