using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace GRPlatForm
{
    /// <summary>
    /// 区域映射类
    /// </summary>
    public static class AreaMappingHelper
    {
      public  static Dictionary<string, string> Village = new Dictionary<string, string>();


        /// <summary>
        /// 该数据主要应对终端 暂时未发现市 县 镇的数据
        /// </summary>
        public static void InitDic()
        {
            Village.Add("00030102", "331124100002");//城南社区
            Village.Add("00030103", "331124100003");//城西社区
            Village.Add("00030104", "331124100004");//城北区
            Village.Add("00030105", "331124100005");//城中区
            Village.Add("00030106", "331124100006");//古城区
            Village.Add("00030107", "331124100231");//邵山脚村
            Village.Add("00030109", "331124100232");//竹客口村
            Village.Add("00030110", "331124100226");//源内村
            Village.Add("00030111", "331124100230");//丁山头村
            Village.Add("00030112", "331124100229");//西坌村
            Village.Add("00030113", "331124100228");//项桥下村

            Village.Add("00030114", "331124100225");//大路口村
            Village.Add("00030115", "331124100215");//北山村
            Village.Add("00030116", "331124100224");//铺门村
            Village.Add("00030117", "331124100212");//上连头村
            Village.Add("00030118", "331124100223");//阳东坑村
            Village.Add("00030119", "331124100222");//官溪村
            Village.Add("00030120", "331124100211");//塔寺下村
            Village.Add("00030121", "331124100220");//桐溪村
            Village.Add("00030122", "331124100218");//乌形山村
            Village.Add("00030123", "331124100006");//瓦厂村?   暂未对应上   沿用古城社区的区划代码


            Village.Add("00030124", "331124100213");//项弄村
            Village.Add("00030125", "331124001233");//黄公渡村
            Village.Add("00030126", "331124100214");//白沙村
            Village.Add("00030127", "331124100221");//活源村
            Village.Add("00030128", "331124100216");//青蒙村
            Village.Add("00030129", "331124100219");//周坌村
            Village.Add("00030130", "331124100217");//水车村
            Village.Add("00030202", "331124100233");//大竹溪村
            Village.Add("00030203", "331124100234");//新溪村
            Village.Add("00030204", "331124100235");//市口村

            Village.Add("00030205", "331124100236");//潘村村
            Village.Add("00030206", "331124100237");//岩西村
            Village.Add("00030207", "331124100238");//桥头村
            Village.Add("00030208", "331124100239");//清路村
            Village.Add("00030209", "331124100240");//郑弄口村
            Village.Add("00030210", "331124100241");//南山村
            Village.Add("00030211", "331124100242");//横山村
            Village.Add("00030212", "331124100243");//踏埠步头村
            Village.Add("00030213", "331124100244");//程徐村
            Village.Add("00030214", "331124100245");//水南村

            Village.Add("00030215", "331124100246");//青龙村
            Village.Add("00030216", "331124100247");//岩下村
            Village.Add("00030217", "331124100248");//塘寮村
            Village.Add("00030218", "331124100249");//东岗寮村
            Village.Add("00030219", "331124100250");//安乐山村
            Village.Add("00030220", "331124100251");//瓦窑头村  
            Village.Add("00030301", "331124200208");//乌井村
            Village.Add("00030302", "331124200215");//砌坛村
            Village.Add("00030303", "331124200200");//六都源口村
            Village.Add("00030304", "331124200202");//吴弄村

            Village.Add("00030305", "331124200201");//六都村
            Village.Add("00030306", "331124200206");//仪桥村
            Village.Add("00030307", "331124200204");//半岭村
            Village.Add("00030308", "331124200211");//郑家村
            Village.Add("00030309", "331124200218");//翁村村
            Village.Add("00030310", "331124200203");//山仁下村
            Village.Add("00030311", "331124200214");//山头背村
            Village.Add("00030312", "331124200213");//麻阳塔村
            Village.Add("00030313", "331124200212");//岗后村
            Village.Add("00030314", "331124200209");//乌石下村

            Village.Add("00030315", "331124200210");//西河村
            Village.Add("00030316", "331124200205");//王村村
            Village.Add("00030317", "331124200216");//草塔村
            Village.Add("00030318", "331124200217");//五都阳村
            Village.Add("00030319", "331124200207");//石门村
            Village.Add("00030320", "331124200219");//榔阳村
            Village.Add("00030401", "331124201206");//叶村村
            Village.Add("00030402", "331124201208");//官田村
            Village.Add("00030403", "331124201205");//寺山村
            Village.Add("00030404", "331124201213");//横坑村


            Village.Add("00030405", "331124201203");//河头村
            Village.Add("00030406", "331124201211");//东坞村
            Village.Add("00030407", "331124201210");//叶村源口村
            Village.Add("00030408", "331124201204");//松山村
            Village.Add("00030409", "331124201209");//麻寮村
            Village.Add("00030410", "331124201201");//叶家村
            Village.Add("00030411", "331124201212");//膳垄村
            Village.Add("00030412", "331124201202");//包安山村
            Village.Add("00030413", "331124201214");//斗米坳村
            Village.Add("00030414", "331124201215");//南岱村

            Village.Add("00030415", "331124201216");//岱头村
            Village.Add("00030501", "331124204202");//小竹溪村
            Village.Add("00030502", "331124204204");//呈田村
            Village.Add("00030503", "331124204205");//可重旺村
            Village.Add("00030504", "331124204208");//黄上村
            Village.Add("00030505", "331124204207");//燕庄村
            Village.Add("00030506", "331124204209");//黄下村
            Village.Add("00030507", "331124204203");//横岗村
            Village.Add("00030508", "331124204206");//潘坑村
            Village.Add("00030509", "331124204210");//周岭根村

            Village.Add("00030510", "331124204200");//后畲村
            Village.Add("00030511", "331124204201");//大岭头村
            Village.Add("00030601", "331124203205");//松庄村
            Village.Add("00030602", "331124203200");//杨家堂村
            Village.Add("00030603", "331124203206");//毛源村
            Village.Add("00030604", "331124203203");//后湾村
            Village.Add("00030605", "331124203202");//酉田村
            Village.Add("00030606", "331124203207");//上庄村
            Village.Add("00030607", "331124203204");//下田村
            Village.Add("00030608", "331124203210");//尹源村

            Village.Add("00030609", "331124203217");//上田村
            Village.Add("00030610", "331124203213");//上源村
            Village.Add("00030611", "331124203201");//岭上村
            Village.Add("00030612", "331124203211");//水竹村
            Village.Add("00030613", "331124203216");//紫草村
            Village.Add("00030614", "331124203209");//淡竹村
            Village.Add("00030615", "331124203212");//呈回村
            Village.Add("00030616", "331124203214");//黄岭根村
            Village.Add("00030617", "331124203215");//周山头村
            Village.Add("00030618", "331124203208");//里庄村

            Village.Add("00030701", "331124205200");//下包村
            Village.Add("00030702", "331124205209");//汤城村
            Village.Add("00030703", "331124205208");//午岭村
            Village.Add("00030704", "331124205204");//平田村
            Village.Add("00030705", "331124205201");//章田村
            Village.Add("00030706", "331124205203");//塘后村
            Village.Add("00030707", "331124205205");//陈家铺村
            Village.Add("00030708", "331124205202");//柘坑村
            Village.Add("00030709", "331124205206");//庄河村
            Village.Add("00030710", "331124205207");//西坑村


            Village.Add("00030711", "331124205210");//榔树村
            Village.Add("00030801", "331124101007");//古南社区 
            Village.Add("00030802", "331124101008");//古北社区  
            Village.Add("00030803", "331124101216");//庄门村
            Village.Add("00030804", "331124101200");//上方村
            Village.Add("00030805", "331124101211");//东角垄村
            Village.Add("00030806", "331124101215");//源口村
            Village.Add("00030807", "331124101217");//白角外村
            Village.Add("00030808", "331124101214");//湖溪村
            Village.Add("00030809", "331124101212");//塘头村

            Village.Add("00030810", "331124101213");//刘边村
            Village.Add("00030811", "331124101005");//筏铺村
            Village.Add("00030812", "331124101218");//上五木村
            Village.Add("00030813", "331124101221");//下五木村
            Village.Add("00030814", "331124101227");//谢树寮村
            Village.Add("00030815", "331124101220");//黄圩村
            Village.Add("00030901", "331124207207");//横溪村
            Village.Add("00030816", "331124101225");//山下阳村
            Village.Add("00030817", "331124101223");//岗下村
            Village.Add("00030902", "331124207216");//大石村

            Village.Add("00030818", "331124101229");//下社村
            Village.Add("00030819", "331124101219");//下黄圩村
            Village.Add("00030903", "331124207215");//后周包村
            Village.Add("00030820", "331124101224");//上河村
            Village.Add("00030904", "331124207214");//杨村头村
            Village.Add("00030821", "331124101222");//寺口村
            Village.Add("00030905", "331124207209");//泉庄村
            Village.Add("00030906", "331124207213");//进贤村
            Village.Add("00030822", "331124101228");//黄埠头村
            Village.Add("00030907", "331124207212");//外孟村

            Village.Add("00030823", "331124101226");//十五里村
            Village.Add("00030908", "331124207208");//渡市村
            Village.Add("00030824", "331124101006");//新铺社区  
            Village.Add("00030909", "331124207219");//金坞村
            Village.Add("00030910", "331124207206");//高丰村
            Village.Add("00030911", "331124207211");//上源口村
            Village.Add("00030912", "331124207210");//徐郑村
            Village.Add("00031001", "331124206203");//赤三村
            Village.Add("00030913", "331124207205");//后刘村
            Village.Add("00030914", "331124207204");//端口村

            Village.Add("00031002", "331124206202");//赤四村
            Village.Add("00030915", "331124207203");//上安村
            Village.Add("00031003", "331124206212");//大川村
            Village.Add("00030916", "331124207217");//内孟村
            Village.Add("00030917", "331124207202");//潘连村
            Village.Add("00030918", "331124207201");//贤溪村
            Village.Add("00031004", "331124206218");//田岗村
            Village.Add("00030919", "331124207218");//大畈村
            Village.Add("00031005", "331124206211");//楼塘村
            Village.Add("00030920", "331124207200");//下源口村

            Village.Add("00030921", "331124210205");//新处村
            Village.Add("00031006", "331124206210");//龙下村
            Village.Add("00030922", "331124210204");//外石塘村
            Village.Add("00030923", "331124210211");//坳后村
            Village.Add("00031007", "331124206217");//黄山头村
            Village.Add("00030924", "331124210209");//小岭头村
            Village.Add("00030925", "331124210208");//东北头村



            Village.Add("00031008", "331124206200");//界首村
            Village.Add("00030926", "331124210200");//小南坑村
            Village.Add("00030927", "331124210203");//张山头村
            Village.Add("00031009", "331124206209");//墙里村
            Village.Add("00030928", "331124210206");//竹坌村
            Village.Add("00030929", "331124210210");//朱山村
            Village.Add("00031010", "331124206208");//半古月村
            Village.Add("00031011", "331124206201");//狮子口村
            Village.Add("00030930", "331124210202");//山甫村
            Village.Add("00031012", "331124206214");//梧桐口村

            Village.Add("00030931", "331124210207");//庄后村
            Village.Add("00030932", "331124210201");//赤岩村
            Village.Add("00031013", "331124206205");//择子山村
            Village.Add("00030933", "331124105243");//官岭村？关 
            Village.Add("00030934", "331124209200");//塔岭村
            Village.Add("00031014", "331124206213");//叶川头村
            Village.Add("00030935", "331124209203");//孟坑村
            Village.Add("00030936", "331124209204");//平卿村
            Village.Add("00031015", "331124206216");//黄坑口村
            Village.Add("00030937", "331124209202");//大岭根村

            Village.Add("00031016", "331124206206");//朝阳村
            Village.Add("00031017", "331124206215");//卯山后村
            Village.Add("00030938", "331124105221");//李山头村
            Village.Add("00031018", "331124206207");//红连村
            Village.Add("00030939", "331124209205");//大岭里村
            Village.Add("00031019", "331124206204");//章家村
            Village.Add("00030940", "331124209206");//南坑村
            Village.Add("00030941", "331124209207");//谢村村
            Village.Add("00030942", "331124209208");//谢西坑村
            Village.Add("00030943", "331124209209");//上仓村

            Village.Add("00030944", "331124209210");//大铺村
            Village.Add("00031101", "331124208211");//肖周村
            Village.Add("00031102", "331124208213");//溪下村
            Village.Add("00031201", "331124202210");//斋坛村
            Village.Add("00031103", "331124208216");//下马坑村
            Village.Add("00031202", "331124202208");//金梁村
            Village.Add("00031104", "331124208214");//兴村村
            Village.Add("00031105", "331124208215");//包村村
            Village.Add("00031106", "331124208217");//高岸村
            Village.Add("00031107", "331124208212");//上徐山村

            Village.Add("00031108", "331124208209");//大徐村
            Village.Add("00031109", "331124208207");//福村村
            Village.Add("00031110", "331124208201");//力溪村
            Village.Add("00031203", "331124202200");//石门圩村
            Village.Add("00031111", "331124208210");//陆家村
            Village.Add("00031112", "331124208208");//兰家村
            Village.Add("00031204", "331124202203");//花田坌村
            Village.Add("00031113", "331124208202");//馒头山村
            Village.Add("00031205", "331124202204");//坎头村
            Village.Add("00031114", "331124208218");//西源村

            Village.Add("00031206", "331124202209");//东圩蓬村
            Village.Add("00031115", "331124208206");//樟村村
            Village.Add("00031116", "331124208221");//黄田村
            Village.Add("00031207", "331124202207");//小石村
            Village.Add("00031208", "331124202201");//东关村
            Village.Add("00031117", "331124208200");//富兴村
            Village.Add("00031209", "331124202205");//大路村
            Village.Add("00031118", "331124208204");//岗头儿村
            Village.Add("00031210", "331124202202");//桐楼村
            Village.Add("00031119", "331124208205");//谷山垄村

            Village.Add("00031120", "331124208203");//东市村
            Village.Add("00031211", "331124202211");//桐村村
            Village.Add("00031121", "331124208219");//杨岭脚村
            Village.Add("00031122", "331124208220");//球坑村
            Village.Add("00031212", "331124202206");//吊坛村
            Village.Add("00031213", "331124202212");//上坌村
            Village.Add("00031214", "331124202213");//下坌村
            Village.Add("00031301", "331124103218");//象一村
            Village.Add("00031302", "331124103216");//象二村
            Village.Add("00031303", "331124103229");//鲁峰村

            Village.Add("00031304", "331124103204");//程路后村
            Village.Add("00031401", "331124213207");//裕溪村
            Village.Add("00031305", "331124103230");//下寮儿村
            Village.Add("00031306", "331124103203");//金山头村
            Village.Add("00031402", "331124213205");//黄岭头村
            Village.Add("00031307", "331124103227");//上梅村
            Village.Add("00031403", "331124213206");//潘山村
            Village.Add("00031308", "331124103228");//陈家里村
            Village.Add("00031309", "331124103231");//村头村
            Village.Add("00031404", "331124213204");//叶西后村

            Village.Add("00031310", "331124103226");//小佛儿村
            Village.Add("00031311", "331124103233");//鲁西村
            Village.Add("00031405", "331124213203");//徐山村
            Village.Add("00031406", "331124213202");//小槎村
            Village.Add("00031312", "331124103225");//靖居村
            Village.Add("00031407", "331124213209");//章山村
            Village.Add("00031313", "331124103232");//塘里源村
            Village.Add("00031408", "331124213201");//内陈村
            Village.Add("00031314", "331124103205");//龙湾村
            Village.Add("00031315", "331124103206");//石鼓村

            Village.Add("00031409", "331124213208");//凤弄源村
            Village.Add("00031316", "331124103224");//石牌门村
            Village.Add("00031410", "331124213210");//合溪村
            Village.Add("00031317", "331124103234");//坑里村
            Village.Add("00031411", "331124213200");//木岱坑村
            Village.Add("00031318", "331124103207");//东田村
            Village.Add("00031412", "331124213211");//源底村
            Village.Add("00031319", "331124103223");//黄店村
            Village.Add("00031320", "331124103211");//石马源村
            Village.Add("00031501", "331124212200");//板桥村


            Village.Add("00031502", "331124212203");//桐榔村
            Village.Add("00031321", "331124103210");//潘弄村
            Village.Add("00031503", "331124212202");//后塘村
            Village.Add("00031322", "331124103208");//吴村村
            Village.Add("00031504", "331124212201");//金村村
            Village.Add("00031323", "331124103221");//金钟村
            Village.Add("00031324", "331124103222");//大塔村
            Village.Add("00031505", "331124212208");//大毛科村
            Village.Add("00031325", "331124103202");//吕潭村
            Village.Add("00031506", "331124212204");//潘八村

            Village.Add("00031326", "331124103209");//雅溪口村
            Village.Add("00031507", "331124212207");//东坑村
            Village.Add("00031327", "331124103212");//石马铺村
            Village.Add("00031508", "331124212205");//张山村
            Village.Add("00031328", "331124103213");//南州村
            Village.Add("00031509", "331124212206");//高山村
            Village.Add("00031329", "331124103217");//高岭村
            Village.Add("00031330", "331124103215");//下坑源村
            Village.Add("00031331", "331124103201");//南坑口村
            Village.Add("00031332", "331124103220");//靖居口村

            Village.Add("00031333", "331124103214");//塔背村
            Village.Add("00031334", "331124103219");//毛弄村
            Village.Add("00031335", "331124103200");//南坑源村
            Village.Add("00031601", "331124104213");//大东坝村
            Village.Add("00031602", "331124104209");//西山村
            Village.Add("00031701", "331124214203");//大潘坑村
            Village.Add("00031603", "331124104212");//白峰村
            Village.Add("00031702", "331124214202");//李坑村
            Village.Add("00031604", "331124104210");//百步村
            Village.Add("00031703", "331124214207");//苏马坪村

            Village.Add("00031605", "331124104214");//赤圩村
            Village.Add("00031606", "331124104219");//上寮山村
            Village.Add("00031704", "331124214205");//曹竹村
            Village.Add("00031607", "331124104211");//牛角圩村
            Village.Add("00031705", "331124214200");//安岱后村
            Village.Add("00031608", "331124104220");//横樟村
            Village.Add("00031706", "331124214204");//台坑村
            Village.Add("00031609", "331124104227");//大樟源口村
            Village.Add("00031707", "331124214206");//乌弄村
            Village.Add("00031610", "331124104208");//七村村

            Village.Add("00031708", "331124214201");//大横坑村
            Village.Add("00031611", "331124104217");//外大阴村
            Village.Add("00031612", "331124104229");//黄南村
            Village.Add("00031901", "331124211212");//枫坪村
            Village.Add("00031902", "331124211209");//金竹村
            Village.Add("00031613", "331124104215");//树稍村
            Village.Add("00031614", "331124104222");//山徐村
            Village.Add("00031903", "331124211210");//钱余村
            Village.Add("00031615", "331124104228");//五部村
            Village.Add("00031616", "331124104216");//二滩坝村


            Village.Add("00031617", "331124104207");//六村村
            Village.Add("00031618", "331124104221");//蛤湖村
            Village.Add("00031619", "331124104206");//山边村
            Village.Add("00031904", "331124211208");//根下村
            Village.Add("00031620", "331124104226");//小后畲村
            Village.Add("00031621", "331124104223");//洋坑埠头村
            Village.Add("00031905", "331124211205");//洋庄源村
            Village.Add("00031622", "331124104205");//下宅街村
            Village.Add("00031623", "331124104204");//山头村
            Village.Add("00031624", "331124104225");//燕田村

            Village.Add("00031906", "331124211214");//黄埠坞村
            Village.Add("00031625", "331124104201");//后宅村
            Village.Add("00031626", "331124104203");//蔡宅村
            Village.Add("00031627", "331124104200");//灯塔村
            Village.Add("00031628", "331124104202");//梨树岗村
            Village.Add("00031629", "331124104218");//内大阴村
            Village.Add("00031630", "331124104224");//明源村
            Village.Add("00031801", "331124102200");//玉岩村
            Village.Add("00031802", "331124102224");//道惠口村
            Village.Add("00031803", "331124102227");//程岭根村

            Village.Add("00031804", "331124102226");//程路村
            Village.Add("00031805", "331124102225");//道惠村
            Village.Add("00031806", "331124102228");//烧火坑村
            Village.Add("00031807", "331124102231");//周坑村
            Village.Add("00031808", "331124102230");//白沙岗村？ 现新岗村村委会
            Village.Add("00031809", "331124102229");//程源头村
            Village.Add("00031810", "331124102215");//西沿头村
            Village.Add("00031811", "331124102213");//洋坑村
            Village.Add("00031812", "331124102216");//大树后村
            Village.Add("00031813", "331124102212");//周安村

            Village.Add("00031814", "331124102217");//潘山头村
            Village.Add("00031815", "331124102222");//大岭脚村
            Village.Add("00031816", "331124102221");//白麻山村
            Village.Add("00031817", "331124102214");//梨步坑村
            Village.Add("00031818", "331124102211");//支木村
            Village.Add("00031819", "331124102220");//交塘村
            Village.Add("00031820", "331124102223");//何山头村
            Village.Add("00031821", "331124102208");//乌岩村
            Village.Add("00031822", "331124102219");//根坑村
            Village.Add("00031823", "331124102218");//何庄村

            Village.Add("00031824", "331124102201");//溪口村
            Village.Add("00031825", "331124102209");//吴山头村
            Village.Add("00031826", "331124102206");//余叶村
            Village.Add("00031827", "331124102203");//沙丘村
            Village.Add("00031828", "331124102207");//坳头村
            Village.Add("00031829", "331124102210");//大丘下村
            Village.Add("00031830", "331124102202");//排居口村
            Village.Add("00031831", "331124102204");//步新村
            Village.Add("00031832", "331124102205");//召楼村
            Village.Add("00031907", "331124211207");//斗潭村

            Village.Add("00031908", "331124211211");//沿坑岭头村
            Village.Add("00031909", "331124211215");//珠岱村
            Village.Add("00031910", "331124211204");//高寮村
            Village.Add("00031911", "331124211206");//山乍口村
            Village.Add("00031912", "331124211203");//高亭村
            Village.Add("00031913", "331124211213");//丁坑村
            Village.Add("00031914", "331124211216");//梨树下村
            Village.Add("00031915", "331124211201");//龙虎坳村
            Village.Add("00031916", "331124211202");//南胜村
            Village.Add("00031917", "331124211200");//小吉村


            Village.Add("00030416", "331124201200");//寺岭下

            Village.Add("00035115", "331124201299");//道家镇 测试数据 20180116


            Village.Add("00032001", "331124201301");//测试1村   需修改
        
        
        }
    }
}
